In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
### Explore dataset

In [2]:
aorig = pd.read_csv('he_choose_detail.csv', header=0, index_col=0)

print(aorig.shape)
aorig.head()

(66177, 9)

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response,Country
0,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale01,0.9394,99,Scotland
1,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale02,0.9158,99,Scotland
2,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale03,0.6944,99,Scotland
3,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale04,0.8838,99,Scotland
4,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale05,0.8636,99,Scotland

In [4]:
test1 = aorig[(aorig['Country'] == 'England') & (aorig['Level'] == 'Other undergraduate') & (aorig['Subject'] == 'Social policy')]

In [9]:
test1[test1['Question Number'] == 'Q27']

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response,Country
1237,10004927,Activate Learning,CAH15-01-03,Social policy,Other undergraduate,Q27,0.2857,14,England
9844,10000975,Buckinghamshire New University,CAH15-01-03,Social policy,Other undergraduate,Q27,0.7059,17,England
13003,10001378,Chesterfield College,CAH15-01-03,Social policy,Other undergraduate,Q27,0.9091,11,England
32260,10003863,Leeds Trinity University,CAH15-01-03,Social policy,Other undergraduate,Q27,1.0000,10,England
49247,10005575,Runshaw College,CAH15-01-03,Social policy,Other undergraduate,Q27,0.9600,18,England

In [10]:
test1[test1['Question Number'] == 'Q26']

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response,Country
1236,10004927,Activate Learning,CAH15-01-03,Social policy,Other undergraduate,Q26,0.3636,11,England
9843,10000975,Buckinghamshire New University,CAH15-01-03,Social policy,Other undergraduate,Q26,0.6471,17,England
49246,10005575,Runshaw College,CAH15-01-03,Social policy,Other undergraduate,Q26,0.6250,17,England

In [11]:
test1['Question Number'].value_counts()

Scale01    5
Q27        5
Scale06    5
Scale04    5
Scale07    5
Scale03    5
Scale02    5
Scale05    5
Scale08    5
Q26        3
Name: Question Number, dtype: int64

In [12]:
for i in aorig.Country.unique():
    schoolnum = len(aorig[aorig.Country == i].Provider.unique())
    print(f"{i} has {schoolnum} schools")

Scotland has 19 schools
Wales has 17 schools
England has 380 schools
Northern Ireland has 9 schools

In [14]:
ni = aorig[aorig.Country == 'Northern Ireland']

print(ni.shape)

ni.head(2)

(1739, 9)

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response,Country
40630,10020634,North West Regional College,CAH03-02-01,Sport and exercise sciences,Other undergraduate,Scale01,0.9423,13,Northern Ireland
40631,10020634,North West Regional College,CAH03-02-01,Sport and exercise sciences,Other undergraduate,Scale02,0.9744,13,Northern Ireland

In [24]:
ni2 = ni[ni.Subject == 'Computer science']

ni2.head(2)

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response,Country
40660,10020634,North West Regional College,CAH11-01-01,Computer science,Other undergraduate,Scale01,0.9423,13,Northern Ireland
40661,10020634,North West Regional College,CAH11-01-01,Computer science,Other undergraduate,Scale02,0.9487,13,Northern Ireland

In [25]:
ni2['Question Number'].value_counts()

Scale01    7
Q27        7
Scale06    7
Scale04    7
Scale07    7
Scale03    7
Scale02    7
Scale05    7
Q26        7
Scale08    7
Name: Question Number, dtype: int64

In [26]:
ni2.Provider.unique()

array(['North West Regional College', 'Northern Regional College',
       "Queen's University of Belfast", 'South Eastern Regional College',
       'South West College', 'Southern Regional College',
       'University of Ulster'], dtype=object)

In [32]:
ni2['Question Number'].value_counts()

Scale01    7
Q27        7
Scale06    7
Scale04    7
Scale07    7
Scale03    7
Scale02    7
Scale05    7
Q26        7
Scale08    7
Name: Question Number, dtype: int64

In [29]:
ni2_test = pd.pivot_table(ni2, values='Response', index=['Level', 'Provider', 'Question Number'], aggfunc=np.sum)

ni2_test

                                                                    Response
Level               Provider                       Question Number
First degree        Queen's University of Belfast  Q26                   126
                                                   Q27                   131
                                                   Scale01               132
                                                   Scale02               132
                                                   Scale03               132
                                                   Scale04               132
                                                   Scale05               132
                                                   Scale06               132
                                                   Scale07               131
                                                   Scale08               132
                    University of Ulster           Q26                   261
                                                   Q27                   272
                                                   Scale01               274
                                                   Scale02               274
                                                   Scale03               274
                                                   Scale04               273
                                                   Scale05               274
                                                   Scale06               274
                                                   Scale07               274
                                                   Scale08               273
Other undergraduate North West Regional College    Q26                    12
                                                   Q27                    13
                                                   Scale01                13
                                                   Scale02                13
                                                   Scale03                13
                                                   Scale04                13
                                                   Scale05                13
                                                   Scale06                13
                                                   Scale07                13
                                                   Scale08                13
...                                                                      ...
                    South Eastern Regional College Q26                    29
                                                   Q27                    33
                                                   Scale01                33
                                                   Scale02                33
                                                   Scale03                33
                                                   Scale04                33
                                                   Scale05                33
                                                   Scale06                33
                                                   Scale07                33
                                                   Scale08                33
                    South West College             Q26                    20
                                                   Q27                    26
                                                   Scale01                27
                                                   Scale02                27
                                                   Scale03                27
                                                   Scale04                27
                                                   Scale05                27
                                                   Scale06                27
                                                   Scale07                27
                                                   Scale08                27
                    Southern Regional College      Q26                    45
                                                   Q27                    46
                                                   Scale01                47
                                                   Scale02                47
                                                   Scale03                47
                                                   Scale04                47
                                                   Scale05                47
                                                   Scale06                47
                                                   Scale07                47
                                                   Scale08                47

[70 rows x 1 columns]

In [31]:
ni2[ni2.Provider == "Queen's University of Belfast"]

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response,Country
46498,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale01,0.7471,132,Northern Ireland
46499,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale02,0.7364,132,Northern Ireland
46500,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale03,0.5171,132,Northern Ireland
46501,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale04,0.6895,132,Northern Ireland
46502,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale05,0.6464,132,Northern Ireland
46503,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale06,0.8707,132,Northern Ireland
46504,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale07,0.6992,131,Northern Ireland
46505,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Scale08,0.6553,132,Northern Ireland
46506,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Q26,0.4343,126,Northern Ireland
46507,10005343,Queen's University of Belfast,CAH11-01-01,Computer science,First degree,Q27,0.7241,131,Northern Ireland

In [34]:
aorig.Subject.value_counts()[:20]

Business studies                         1790
Computer science                         1718
Education                                1699
Sport and exercise sciences              1647
Design studies                           1514
Drama                                    1484
Sociology                                1347
Management studies                       1343
Music                                    1327
Others in subjects allied to medicine    1325
Cinematics and photography               1313
Psychology (non-specific)                1298
Law                                      1243
Tourism, transport and travel            1204
Accounting                               1110
Media studies                            1109
Social work                              1064
Politics                                 1049
Marketing                                 999
History                                   978
Name: Subject, dtype: int64

In [35]:
test_set = ['one', 'two', 'three']

len(set(test_set))

3

In [39]:
len(set(['one', 'two', 'two']))

2

In [3]:
# no missing data
aorig.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 243080 entries, 0 to 243079
Data columns (total 18 columns):
UKPRN                        243080 non-null int64
Provider                     243080 non-null object
Subject Code                 243080 non-null object
Subject                      243080 non-null object
Level                        243080 non-null object
Question Number              243080 non-null object
Answered 1                   243080 non-null float64
Answered 2                   243080 non-null float64
Answered 3                   243080 non-null float64
Answered 4                   243080 non-null float64
Answered 5                   243080 non-null float64
N/A                          243080 non-null int64
Confidence interval - min    243080 non-null float64
Actual value                 243080 non-null float64
Confidence interval - max    243080 non-null float64
Response                     243080 non-null int64
Sample Size                  243080 non-null int64
Two years aggregate data?    37560 non-null object
dtypes: float64(8), int64(4), object(6)
memory usage: 33.4+ MB

## Explore Other Undergraduate

In [4]:
aother = aorig[aorig.Level == 'Other undergraduate']
areg = aorig[aorig.Level == 'First degree']

print(aother.shape)
print(areg.shape)

(38914, 18)
(204166, 18)

In [5]:
print(len(aother.Provider.unique()))
print(len(areg.Provider.unique()))

300
298

In [6]:
print(len(aother.Subject.unique()))
print(len(areg.Subject.unique()))

93
150

In [7]:
# Other undergraduate is likely more specialized / cert or diploma
# should keep
aother.Subject.value_counts()[:10]

Education                                2940
Sport and exercise sciences              2555
Computer science                         2205
Business studies                         1995
Others in subjects allied to medicine    1890
Tourism, transport and travel            1785
Design studies                           1400
Cinematics and photography               1365
Management studies                       1294
Health studies                           1274
Name: Subject, dtype: int64

In [8]:
areg.Subject.value_counts()[:10]

Business studies             4375
Psychology (non-specific)    4235
Sociology                    4130
Law                          4095
Drama                        4060
Design studies               3990
Computer science             3850
Accounting                   3780
Music                        3605
Management studies           3535
Name: Subject, dtype: int64

## Build Dataset

In [45]:
len(aorig.Subject.unique())

151

In [46]:
q_keep = ['Scale01','Scale02','Scale03','Scale04','Scale05','Scale06','Scale07','Scale08','Q26','Q27',]

aedit = aorig[aorig['Question Number'].isin(q_keep)]

print(aedit.shape)
aedit.head(2)

(68614, 18)

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Answered 1,Answered 2,Answered 3,Answered 4,Answered 5,N/A,Confidence interval - min,Actual value,Confidence interval - max,Response,Sample Size,Two years aggregate data?
4,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale01,0.0000,0.0177,0.0429,0.3965,0.5429,0,0.8648,0.9394,0.9741,99,173,NaN
8,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale02,0.0034,0.0303,0.0505,0.2997,0.6162,0,0.8348,0.9158,0.9590,99,173,NaN

In [47]:
# may consider filtering out subjects < 100
# 10 rows for questions  == per college; depending on Level
aedit['Subject'].value_counts()[-20:]

Biosciences (non-specific)                40
Physical sciences (non-specific)          40
Hair and beauty sciences                  40
Welsh studies                             40
Forestry and arboriculture                40
Others in engineering                     40
Materials science                         40
Operational research                      40
Others in English studies                 40
Others in computing                       40
Naval architecture                        40
Polymers and textiles                     30
Minerals technology                       30
Celtic studies (non-specific)             20
Heritage studies                          20
Community nursing                         20
Others in Celtic studies                  20
Business computing                        10
Personal development                      10
Business and management (non-specific)    10
Name: Subject, dtype: int64

In [48]:
small_subject = aedit['Subject'].value_counts()
small_subject = small_subject[small_subject < 100]

print(len(small_subject))
small_subject = small_subject.index.tolist()
small_subject[:10]

37

['Veterinary medicine and dentistry',
 'Humanities (non-specific)',
 'African and modern Middle Eastern studies',
 'Creative arts and design (non-specific)',
 'Publishing',
 'Combined, general or negotiated studies',
 'Landscape design',
 'Development studies',
 'Maritime technology',
 'Food sciences']

In [49]:
# subjects with less than 100 rows removed
# i.e. subjects taught at < 10 universities
aedit = aedit[aedit.Subject.isin(small_subject) ==False]

len(aedit.Subject.unique())

114

In [50]:
aedit = aedit[aedit.Response >= 10]

aedit.shape

(66584, 18)

In [51]:
aedit = aedit[['UKPRN', 'Provider', 'Subject Code', 'Subject', 'Level',
               'Question Number','Actual value', 'Response']]

aedit.head(2)

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response
4,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale01,0.9394,99
8,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale02,0.9158,99

In [52]:
aedit.describe()

              UKPRN  Actual value      Response
count  6.658400e+04  66584.000000  66584.000000
mean   1.007478e+07      0.776012     52.889072
std    2.465184e+06      0.140677     61.915694
min    1.000006e+07      0.000000     10.000000
25%    1.000480e+07      0.702200     16.000000
50%    1.000716e+07      0.801100     30.000000
75%    1.000780e+07      0.876500     65.000000
max    1.000000e+08      1.000000   1514.000000

In [55]:
# remaining features
print(f"Schools remaining: {len(aedit.Provider.unique())}")
print(f"Subjects remaining: {len(aedit.Subject.unique())}")
print(aedit.Level.value_counts())

Schools remaining: 445
Subjects remaining: 114
First degree           55931
Other undergraduate    10653
Name: Level, dtype: int64

## Add country

In [57]:
cn_df = pd.read_excel('NSS Answers.xlsx', sheet_name='Scale 1', skiprows=4)

cn_df.head(2)

,UKPRN,Provider,Agree (%),Benchmark (%),+/-,Agree (%).1,Benchmark (%).1,+/-.1,Agree (%).2,Benchmark (%).2,+/-.2,Agree (%).3,Benchmark (%).3,+/-.3,Country
0,10007783,University of Aberdeen,85.40,85.00,NaN,85.40,85.00,NaN,86.39,84.91,NaN,86.39,84.91,NaN,Scotland
1,10007849,University of Abertay Dundee,81.64,84.14,NaN,81.64,84.14,NaN,87.44,83.89,NaN,87.44,83.89,NaN,Scotland

In [59]:
cn_df = cn_df[['UKPRN', 'Country']]

cn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 451 entries, 0 to 450
Data columns (total 2 columns):
UKPRN      451 non-null int64
Country    451 non-null object
dtypes: int64(1), object(1)
memory usage: 7.1+ KB

In [60]:
aedit = pd.merge(aedit, cn_df, on='UKPRN')

print(aedit.info())
aedit.head(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66177 entries, 0 to 66176
Data columns (total 9 columns):
UKPRN              66177 non-null int64
Provider           66177 non-null object
Subject Code       66177 non-null object
Subject            66177 non-null object
Level              66177 non-null object
Question Number    66177 non-null object
Actual value       66177 non-null float64
Response           66177 non-null int64
Country            66177 non-null object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.0+ MB
None

,UKPRN,Provider,Subject Code,Subject,Level,Question Number,Actual value,Response,Country
0,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale01,0.9394,99,Scotland
1,10007783,University of Aberdeen,CAH01-01-02,Medicine (non-specific),First degree,Scale02,0.9158,99,Scotland

In [61]:
# aedit.to_csv('he_choose_detail.csv')

In [62]:
aedit.Level.unique()

array(['First degree', 'Other undergraduate'], dtype=object)

In [66]:
piv_test = pd.pivot_table(aedit, values='Response', index=['Country', 'Level'], aggfunc=np.sum)

piv_test

                                      Response
Country          Level
England          First degree          2749300
                 Other undergraduate    216982
Northern Ireland First degree            72761
                 Other undergraduate      8325
Scotland         First degree           276436
                 Other undergraduate      2355
Wales            First degree           165697
                 Other undergraduate     12636

In [68]:
aedit['Question Number'].value_counts()

Scale04    6642
Scale02    6642
Scale06    6642
Scale05    6642
Scale03    6642
Scale01    6642
Scale07    6641
Scale08    6637
Q27        6629
Q26        6418
Name: Question Number, dtype: int64